In [2]:
import pandas as pd

In [3]:
datos = pd.DataFrame()

In [5]:
type(datos)

pandas.core.frame.DataFrame

In [22]:
import pandas as pd
df_empleados = {"nombre":['Ana', 'Luis' , 'Carlos'], "edad":[30, 25, 40]}
df_empleados = pd.DataFrame(df_empleados)

In [23]:
df_empleados

   nombre  edad
0     Ana    30
1    Luis    25
2  Carlos    40

In [32]:
index_df=df_empleados.index
columns_df=df_empleados.columns
shape_df=df_empleados.shape
print(shape_df, columns_df, index_df)

(3, 2) Index(['nombre', 'edad'], dtype='object') RangeIndex(start=0, stop=3, step=1)

(3, 2)

Index(['nombre', 'edad'], dtype='object')

In [34]:
df = pd.read_csv("C:/Users/Pablo\Documents/Cursos UDEMY/Curso_Python-DS-ML/Curso_Python-DS-ML/DÃ­a6-Pandas-p1/Precipitaciones.csv")

In [36]:
df.head()

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
0,A CORUNA,240.5,293.4,31.0,80.6,149.5,108.9,44.6,21.8,96.5,154.5,100.8,214.8,1536.9
1,ALBACETE,68.1,28.0,26.2,65.3,25.4,50.0,2.0,34.5,48.0,44.8,33.1,14.1,439.5
2,ALICANTE,49.2,3.7,63.2,85.8,57.2,20.0,9.2,5.0,44.0,41.1,47.4,1.8,427.6
3,ALMERIA,56.3,5.2,35.8,43.1,38.8,16.9,10.2,1.9,17.4,27.3,32.6,3.2,288.7
4,ARABA,96.8,79.9,38.0,52.0,37.7,107.8,8.5,17.7,63.3,38.5,212.2,197.3,949.7

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   region      52 non-null     object
 1   enero       52 non-null     float64
 2   febrero     52 non-null     float64
 3   marzo       52 non-null     float64
 4   abril       52 non-null     float64
 5   mayo        52 non-null     float64
 6   junio       52 non-null     float64
 7   julio       52 non-null     float64
 8   agosto      52 non-null     float64
 9   septiembre  52 non-null     float64
 10  octubre     52 non-null     float64
 11  noviembre   52 non-null     float64
 12  diciembre   52 non-null     float64
 13  anual       52 non-null     float64
dtypes: float64(13), object(1)
memory usage: 5.8+ KB

In [38]:
df.describe()

,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
count,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000,52.000000
mean,92.996154,78.632692,26.684615,64.500000,38.305769,54.182692,11.840385,17.178846,62.246154,54.373077,82.494231,76.192308,659.626923
std,57.127171,67.454280,31.473913,21.421942,29.079576,36.821635,13.256390,13.939496,28.581205,36.619785,91.689789,80.409042,352.905548
min,26.800000,2.300000,3.300000,3.500000,0.700000,1.100000,0.000000,0.000000,0.900000,1.000000,7.100000,1.800000,108.200000
25%,53.825000,32.825000,9.125000,53.950000,18.875000,26.325000,1.600000,4.850000,46.000000,29.825000,32.375000,22.075000,455.925000
50%,73.950000,62.600000,17.200000,62.700000,35.650000,50.400000,6.150000,16.500000,62.300000,46.550000,46.950000,47.950000,548.550000
75%,97.300000,102.550000,35.425000,77.625000,48.750000,78.025000,17.875000,26.550000,81.625000,74.500000,102.725000,107.000000,665.150000
max,261.900000,335.700000,209.800000,128.400000,149.500000,145.000000,46.800000,57.000000,122.800000,175.700000,384.600000,314.700000,1575.400000

In [39]:
df.tail()

,region,enero,febrero,marzo,abril,mayo,junio,julio,agosto,septiembre,octubre,noviembre,diciembre,anual
47,TOLEDO,83.0,51.1,7.5,62.5,15.0,27.1,3.3,18.6,70.5,94.7,16.4,29.9,479.6
48,VALENCIA,61.9,16.8,49.3,86.4,33.8,34.2,17.1,30.9,99.3,46.1,46.6,5.5,527.9
49,VALLADOLID,29.2,69.1,4.1,65.1,24.3,58.3,1.9,3.8,54.1,40.2,41.7,35.9,427.7
50,ZAMORA,53.0,112.0,6.8,63.7,19.8,54.2,3.1,9.6,78.5,55.3,29.0,50.3,535.3
51,ZARAGOZA,52.0,30.0,3.6,52.7,38.3,57.5,13.5,13.2,61.5,27.4,76.6,23.4,449.7

In [42]:
df.shape

(52, 14)

In [44]:
import pandas as pd 
head_df=df.head()
tail_df=df.tail()

In [46]:
numeros = [4, 7, -5, 3]
mi_serie = pd.Series(numeros)
print(mi_serie)

0    4
1    7
2   -5
3    3
dtype: int64

In [47]:
import pandas as pd
lista =[10, 20, 30, 40]
indices = ['a', 'b', 'c', 'd']
serie_con_indices=pd.Series(lista,indices)
valor_c='c'
def imprimir_valor_c(valor_c):
    print(serie_con_indices[valor_c])
    
imprimir_valor_c(valor_c)

30

In [48]:
import pandas as pd
serie_grande = pd.Series([1,2,3,4,5,6,7,8,9,10])

print(serie_grande[9]**1/2)

5.0

In [50]:
serie_grande[8]

9

In [52]:
data = {
    'ID': [1, 2, 3, 4, 5],
    'Producto': ['Producto A', 'Producto B', None, 'Producto D', 'Producto E'],
    'Cantidad': [10, 20, 30, None, 50],
    'Precio': [100, 200, 300, 400, None]
}

import pandas as pd

In [66]:
df = pd.DataFrame(data)
df.isnull().sum()

ID          0
Producto    1
Cantidad    1
Precio      1
dtype: int64

In [63]:
df.shape

(5, 4)

In [65]:
df.isnull().sum()

ID          0
Producto    1
Cantidad    1
Precio      1
dtype: int64

In [69]:
import pandas as pd

data = {
    'ID': [1, 2, 3, 4, 1],
    'Producto': ['Producto A', 'Producto B', 'Producto C', 'Producto D', 'Producto A'],
    'Cantidad': [10, 20, 30, 40, 50],
    'Precio': [100, 200, 300, 400, 100]
}

df = pd.DataFrame(data)
df_sin_duplicados = df.drop_duplicates(subset="ID")

df_sin_duplicados

   ID    Producto  Cantidad  Precio
0   1  Producto A        10     100
1   2  Producto B        20     200
2   3  Producto C        30     300
3   4  Producto D        40     400

In [72]:
import pandas as pd

data = {
    'ID': [1, 2, 3, 4],
    'Producto': ['Producto A', 'Producto B', 'Producto C', 'Producto D'],
    'Cantidad': [10, 20, 30, 40],
    'Precio': [100, None, 300, None]
}

df = pd.DataFrame(data)
replazo = {'Precio': df["Precio"].mean()}

df_sin_nulos = df.fillna(replazo)
df_sin_nulos

   ID    Producto  Cantidad  Precio
0   1  Producto A        10   100.0
1   2  Producto B        20   200.0
2   3  Producto C        30   300.0
3   4  Producto D        40   200.0

In [76]:
import pandas as pd
serie_numeros = pd.Series(range(1,21))

filtro = serie_numeros > 10

serie_numeros = serie_numeros[filtro]
serie_numeros

10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
dtype: int64

In [77]:
import pandas as pd
valores = pd.Series([18, 22, 7, 9, 15, 8])

condicion_valores_pares = valores % 2 == 0

valores = valores[condicion_valores_pares]
valores

0    18
1    22
5     8
dtype: int64

In [78]:
import pandas as pd
frutas = pd.Series(["manzana", "banana", "cereza", "durazno", "frambuesa"])

frutas_con_e = frutas.str.contains("e")

frutas= frutas[frutas_con_e]
frutas

2       cereza
4    frambuesa
dtype: object

In [82]:
import pandas as pd

# Lista de edades
edades = [23, 30, 26, 27, 22, 24, 25, 28]
numeros = pd.Series(edades)

promedio_edades=numeros.mean()

promedio_edades

25.625

In [97]:
import pandas as pd
ventas = [120, 150, 90, 200, 210, 130, 160]

serie = pd.Series(ventas, ['Lunes','Martes','Miercoles','Jueves','Viernes','Sabado','Domingo'])

suma_total_ventas = serie.sum()
dia_mayores_ventas = serie.max()
promedio_ventas = serie.mean()

In [98]:
import pandas as pd

# Serie de ventas del mes
ventas_mes = pd.Series([220, 235, 260, 213, 202, 298, 265, 198, 220, 230, 190, 215, 275, 222, 218, 245, 233, 210, 290, 210,
                        215, 220, 225, 230, 245, 250, 260, 270, 280, 295])
                        
                        
total_ventas_mes = ventas_mes.sum()
dia_ventas_mas_bajas = ventas_mes.min()
promedio_ventas_mes = ventas_mes.mean()